Revit 2027 API
NumberingFormatSettings Methods
The NumberingFormatSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParameter |  Get the parameter at the provided index incorporated into the numeric label.
GetParameters |  Get parameters incorporated into the numeric label.
GetType | Gets the Type of the current instance.
(Inherited from Object)
RemoveParameter |  Remove a parameter from a specific index. The position where the parameter to be removed.
SetParameter |  Set parameter incorporated into the numeric label. Parameter to be added into the label The position where the parameter to be added
SetParameters |  Set parameters incorporated into the numeric label.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace